Revit 2027 API
PathReinforcement.IsValidAlternatingBarOrientation Method
 Checks if orientation for alternating bars is valid.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidAlternatingBarOrientation(
	ReinforcementBarOrientation orientation
)
Public Function IsValidAlternatingBarOrientation (
	orientation As ReinforcementBarOrientation
) As Boolean
public:
bool IsValidAlternatingBarOrientation(
	ReinforcementBarOrientation orientation
)
member IsValidAlternatingBarOrientation :
        orientation : ReinforcementBarOrientation -> bool
Parameters
orientation ReinforcementBarOrientation
 An orientation.
Return Value
Boolean
 True if orientation for alternating bars are valid.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace